Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/health/health_services/alcohol_and_drug_treatment_services/alcohol_addiction_services.html.txt.tmx
Source language: en
Languages: ga

source: Alcohol addiction treatment services
ga: Seirbhísí chun andúil a chóireáil

source: Local Health Offices of the Health Service Executive (HSE) provide alcohol addiction services, funded through the Department of Health
ga: Soláthraíonn d’Oifig Sláinte Áitiúil d’Fheidhmeannacht na Seirbhíse Sláinte (FSS) seirbhísí um andúil san alcól, a chistítear tríd an Roinn Sláinte

source: There are also a number of private programmes, which offer help to those trying to combat the effects of alcohol addiction
ga: Tá líon cláir phríobháideacha ann, chomh maith, a chuireann cabhair ar fáil dóibh siúd a bhfuil iarracht á déanamh acu tionchar na handúile san alcól a chomhrac

source: Alcohol addiction can be treated in a residential or non-residential setting
ga: Féadtar cóir a chur ar andúil san alcól i suíomh cónaithe nó neamhchónaithe

source: It will depend on your circumstances and your own personal preferences
ga: Braithfidh sé ar do chúinsí agus ar do roghanna pearsanta féin

source: Most people are treated in the community in non-residential settings
ga: Cuirtear cóir ar fhormhór na ndaoine sa phobal i suíomhanna neamhchónaithe

source: Some of the treatment options available are as follows:
ga: Seo a leanas cuid de na roghanna cóireála atá ar fáil:

source: If you have a mental illness and alcoholism you can access your local mental health services and they will also support you to access addiction services
ga: Má tá galar meabhrach ort agus má tá tú tugtha don ól, féadfaidh tú rochtain a fháil ar do sheirbhísí áitiúla meabhairshláinte agus tacóidh siad leat, chomh maith, chun rochtain a fháil ar sheirbhísí andúile

source: Depending on your treatment needs, you may be referred back to your GP for continuous care
ga: Ag brath ar do riachtanais chóireála, b’fhéidir go n-atreorófar ar ais thú chuig do LG go dtabharfar cúram leanúnach duit

source: Addiction counsellors provide assessment, counselling, information and treatment services
ga: Soláthraíonn comhairleoirí andúile seirbhísí measúnaithe, comhairleoireachta, faisnéise agus cóireála ar fáil

source: Before receiving counselling you must go through a detoxification programme, if necessary
ga: Sula ndéantar comhairleoireacht leat, ní mór duit tabhairt faoi chlár díthocsainithe, más gá

source: You are then referred to the community-based addiction treatment service
ga: Atreoraítear ansin thú chuig an tseirbhís chóireála andúile atá bunaithe sa phobal

source: An individual and group counselling approach is commonly used
ga: Baintear leas de ghnáth as cur chuige comhairleoireachta aonair agus grúpa

source: As well as addiction counselling, community care services may run other alcohol-related courses
ga: Anuas ar chomhairleoireacht andúile, féadfaidh seirbhísí cúram pobail cúrsaí eile a reáchtáil a bhaineann le halcól

source: Family therapy, couples therapy, and groups for concerned persons will address the issues that problem drinking can bring up in these particular relationships
ga: Rachaidh teiripe teaghlaigh, teiripe lánúineacha, agus grúpaí atá dírithe ar dhaoine atá buartha, i ngleic leis na saincheisteanna ar féidir le hól fadhbach a thabhairt chun solais sa chaidreamh ar leith seo

source: Detoxification removes the physical craving for alcohol that is a symptom of alcohol addiction
ga: Baineann díthocsainiú an fonn fisiciúil chun deochanna ina bhfuil alcól a ól, atá ina shiomptóm d’andúil san alcóil

source: Detoxification can take place on an out-patient basis under the supervision of a GP
ga: Féadtar tabhairt faoi dhíthocsainiú ar bhonn othar seachtrach faoi mhaoirsiú LG

source: A reducing dose of a strong anti-anxiety drug, will be prescribed to ease the effects of alcohol withdrawal
ga: Déanfar dáileog laghdaitheach de dhruga láidir frithimní a ordú chun an tionchar a laghdú a bhíonn ag éirí as an alcól

source: Detoxification does not deal with the psychological issues that cause a person to abuse alcohol
ga: Ní dhéileálann díthocsainiú leis na saincheisteanna síceolaíocha is cúis le mí-úsáid a bhaint as alcól

source: For a successful outcome, people usually have to go through counselling to understand their addiction and change their behaviour patterns
ga: Go mbainfear toradh rathúil amach, is gnách go mbíonn ar dhaoine tabhairt faoi chomhairleoireacht go dtuigfidh siad a n-andúil agus go n-athróidh siad a bpatrúin iompair

source: Your GP can talk to you about a suitable detoxification programme
ga: Féadfaidh do LG labhairt leat faoi chlár oiriúnach díthocsainithe

source: Use of prescribed drugs to treat alcohol addiction
ga: Drugaí ordaithe a úsáid chun cóir a chur ar andúil san alcól

source: In some cases, medication may be prescribed to help them in the initial stages of treatment
ga: I roinnt cásanna, féadtar cógas a ordú chun cabhrú leis na céimeanna tosaigh den chóireáil

source: The use of drugs to treat addiction is called pharmocotherapy and most of the commonly used drugs will be covered by the Drugs Payment Scheme
ga: Tugtar teiripe chógaisíochta ar úsáid drugaí chun cóir a chur ar andúil agus beidh formhór na ndrugaí is coitianta a úsáidtear cumhdaithe faoin Scéim Íocaíochta Drugaí

source: Residential treatment takes the client away from their usual environment and all sources of alcohol
ga: Déanann cóireáil chónaithe an cliant a thabhairt óna ngnáth-thimpeallacht chónaithe agus ó gach foinse alcóil

source: Patients are weaned off their dependence on alcohol and begin a therapy programme, Age limits can vary depending on the programme
ga: Déantar an brath a bhíonn ag othair ar alcól a laghdú de réir a chéile agus cuireann siad tús le clár teiripe

source: Some programmes are designed to deal with people as young as 15, while others may only accept over 18s
ga: D’fhéadfadh aoisteorainneacha éagsúla a bheith i gceist, ag brath ar an gclár

source: Programmes will generally have a small number of participants The costs of residential programmes vary
ga: Tá roinnt clár deartha chun déileáil le daoine a óige le 15 bliana d’aois, agus d’fhéadfadh nach nglacfadh cláir eile ach le daoine os cionn 18 mbliana d’aois

source: Depending on the programmes, the costs may be covered by a medical card
ga: Is gnách go mbíonn líon beag rannpháirtithe sna cláir

source: To find out if there is a charge, you should contact the treatment centre directly
ga: Lena dheimhniú an ngearrtar táille, ba cheart duit teagmháil a dhéanamh leis an ionad cóireála go díreach

source: If you don’t have a medical card you can request approval for funding from your Local Health Office
ga: Mura bhfuil cárta leighis agat, féadfaidh tú iarraidh ar fhaomhadh chun cistiú a fháil ó d’Oifig Sláinte Áitiúla

source: The Manager of Community Services will make a decision on your request
ga: Déanfaidh an Bainisteoir Seirbhísí Pobail cinneadh ar d’iarratas

source: Group meetings for those affected by alcohol abuse
ga: Cruinnithe grúpa dóibh siúd a ndéanann mí-úsáid alcóil difear dóibh

source: Group meetings like Alcoholics Anonymous are run independently of the HSE, although meetings may take place on HSE premises
ga: Reáchtáiltear cruinnithe grúpa, ar nós Alcólaigh gan Ainm neamhspleách ar Fheidhmeannacht na Seirbhíse Sláinte (FSS), cé go bhféadfadh cruinnithe a bheith ar siúl in áitribh FSS

source: There are other groups that provide support to those affected by someone's problem drinking
ga: Tá grúpa eile ann a sholáthraíonn tacaíocht dóibh siúd a ndéanann ól fadhbach duine eile difear dóibh

source: Privately run groups are generally free of charge
ga: Is gnách go mbíonn grúpaí a reáchtáiltear go príobháideach saor in aisce

source: There are a number of private treatment services for alcohol addiction
ga: Tá líon seirbhísí cóireála príobháideacha ann d’andúil san alcól

source: The services they provide are very similar to those provided by the HSE
ga: Tá na seirbhísí a sholáthraíonn siad an-chosúil leo siúd a sholáthraíonn FSS

source: You will have a choice of residential treatment or treatment as an out-patient
ga: Beidh rogha de chóireáil chónaithe nó de chóireáil mar othar seachtrach agat

source: Private treatment programmes are not free of charge and prices will vary depending on the programme
ga: Níl cláir chóireála phríobháideacha saor in aisce agus braithfidh na praghsanna ar an gclár

source: These costs may be covered by private health insurance
ga: D’fhéadfadh go mbeadh cuid de na costais seo cumhdaithe ag árachas sláinte príobháideach

source: Alcohol addiction services that are run by your Local Health Office of the HSE are public services and all out-patient services are free of charge
ga: Seirbhísí poiblí iad seirbhísí andúile san alcól a reáchtálann d’Oifig Sláinte Áitiúil de FSS agus tá gach seirbhís othair sheachtraigh saor in aisce

source: There may be a charge for residential programmes
ga: D’fhéadfadh go ngearrfaí táille ar chláir chónaithe

source: Private health insurance or a medical card may cover stays in selected drug treatment centres
ga: B’fhéidir go gcumhdódh árachas sláinte príobháideach nó cárta leighis na costais má fhanann tú in ionaid áirithe chóireála drugaí

source: For more details, you should contact your health insurer
ga: Chun teacht ar a thuilleadh sonraí, ba cheart duit teagmháil a dhéanamh le d’árachóir sláinte

source: You can check with your pharmacy whether medication you are prescribed to treat symptoms of alcohol addiction qualifies under the Drugs Payment Scheme
ga: Féadfaidh tú a sheiceáil le do chógaiseoir cibé acu an gcáilíonn nó nach gcáilíonn an cógas a ordaítear duit chun cóir a chur ar shiomptóim na handúile san alcól faoin Scéim Íocaíochta Drugaí

source: Your Local Health Office can help you find alcohol addiction services in your area
ga: Féadfaidh d’Oifig Sláinte Áitiúil cabhrú leat chun teacht ar sheirbhísí andúile san alcól i do cheantar

source: Your GP can also refer you to your local addiction services
ga: Anuas air sin, féadfaidh do LG thú a atreorú chuig do sheirbhísí áitiúla andúile

source: There you will be assessed and your treatment options will be explained to you
ga: Déanfar measúnú ort agus míneofar do roghanna cóireála duit ansin

source: Private treatment programmes vary in their admission requirements, so you may need to contact them directly to find out what you need to do
ga: Is éagsúil atá cláir chóireála phríobháideacha maidir lena riachtanais iontrála, mar sin, b’fhéidir go mbeidh ort teagmháil dhíreach a dhéanamh leo lena dheimhniú cad is gá duit a dhéanamh

source: If you need advice, your GP should also be able to help you
ga: Má theastaíonn comhairle uait, ba cheart go mbeadh do LG in ann cabhrú leat

source: You can also contact professional bodies to find out more information about addiction counsellors in your area
ga: Féadfaidh tú teagmháil a dhéanamh le comhlachtaí gairmiúla, chomh maith, chun teacht ar bhreis faisnéise faoi chomhairleoirí andúile i do cheantar

source: You can contact your Local Health Office for information about addiction services
ga: Cá háit a ndéanfaidh mé iarratas

source: There is a national directory of alcohol and drugs services on the website drugs.ie
ga: Féadfaidh d’Oifig Sláinte Áitiúil cabhrú leat chun teacht ar sheirbhísí andúile san alcól i do cheantar

source: Alcohol Action Ireland provides a list of useful links for help and support
ga: Féadfaidh tú teacht ar sheirbhísí cóireála alcóil i do cheantar trí threoir ar líne Ghníomhú i leith an Alcóil Éireann (‘Alcohol Action Ireland’) maidir le seirbhísí alcóil timpeall na tíre a úsáid
